Revit 2027 API
ParameterTypeId.StairsRunCreationChainSpiral Property
 "Keep concentric": Built-in param for biding flag for chaining spiral runs during creation with Ribbon UI controls
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId StairsRunCreationChainSpiral { get; }
Public Shared ReadOnly Property StairsRunCreationChainSpiral As ForgeTypeId
	Get
public:
static property ForgeTypeId^ StairsRunCreationChainSpiral {
	ForgeTypeId^ get ();
}
static member StairsRunCreationChainSpiral : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace